let x = 6;
let y = 14;
let z = 4;

let rez1 = x += y- x++ * z;
document.write('x += y- x++ *z ' + 'Дорівнює ' + rez1 + "<br />");
// Спочатку х++ = 6, потім 6*4=24, 14-24=-10, х=-10+6 =-4.

x = 6;
y = 14;
z = 4;

let rez2 = z=--x - y * 5;
document.write('z = --x - y * 5 ' + 'Дорівнює ' + rez2 + "<br />");
// Спочатку --х виходить 5, потім * 14*5=70, 5-70=-65.

x = 6;
y = 14;
z = 4;

let rez3 = y /= x + 5 % z;
document.write('y /= x + 5 % z ' + 'Дорівнює ' + rez3 + "<br />"); 
// Спочатку виконується %, 5/4 остача 1, потім виконується +, 6+1=7, потім /= 14/7= 2.

x = 6;
y = 14;
z = 4;

let rez4 = z - x++ + y * 5;
document.write('z - x++ + y * 5 ' + 'Дорівнює ' + rez4 + "<br />");
// Спочатку х++ = 6, 14*5=70, 4-6=-2, -2+70=68.

x = 6;
y = 14;
z = 4;

let rez5 = x = y - x++ *z;
document.write('x = y - x++ *z ' + 'Дорівнює ' + rez5 + "<br />");
// Спочатку х++ = 6, 6*4=24, 14-24=-10.